[
    {
        "title": "Wix Website Update",
        "description": "I am looking for a skilled professional to update my existing Wix website. The website is already set up, but I need someone to make changes and improvements to enhance its functionality and appearance. The main tasks include updating the content, adding new pages, optimizing the website for search engines, and ensuring mobile responsiveness. The ideal candidate should have experience in Wix website development, knowledge of HTML and CSS, and an eye for design. Attention to detail and the ability to work within a given timeframe are essential. Strong communication skills are also required to understand and implement the client's requirements effectively.",
        "tags": [
            "WordPress",
            "Wix",
            "Web Design",
            "Web Development",
            "Graphic Design"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Wix-Website-Update_~0143964dde89e54f02/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Wordpress site development",
        "description": "Simple lead generation wordpress website with 2 products that will have links to Amazon listing. Please share examples of sites you have built. Ideally this will be one or two pages. Thank you",
        "tags": [
            "WordPress",
            "Web Design",
            "Web Development"
        ],
        "rate": "Hourly: $40.00 - $80.00",
        "exp_lvl": "Expert",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/span-class-highlight-Wordpress-span-site-development_~013ac44187b238e020/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Convert WP site from elementor pro to something easier to manage",
        "description": "Website was updated 4-5 years ago and uses elementor pro-which sucks when the host updates the php. Causes the website to not display properly and generate ad errors. Want to convert to something easier to update.",
        "tags": [
            "WordPress",
            "Website"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Entry Level",
        "est_time": "$100.00",
        "link": "https://www.upwork.com/jobs/Convert-site-from-elementor-pro-something-easier-manage_~014fb53ed1b5a48596/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Virtual Assistant for various tasks for a website related to music lessons.",
        "description": "I am looking for someone to takeover some daily administrative tasks for a couple of hours per day. The tasks are varied. The work isn't complicated, but a background in web research, Wordpress, editing, and SEO is necessary. This is for a website related to music lessons, so if you have experience with music, it's a plus.",
        "tags": [
            "WordPress",
            "Google Docs",
            "Writing",
            "SEO Audit",
            "Grammarly",
            "+4"
        ],
        "rate": "Hourly: $5.00 - $10.00",
        "exp_lvl": "Intermediate",
        "est_time": "More than 6 months, 30+ hrs/week",
        "link": "https://www.upwork.com/jobs/Virtual-Assistant-for-various-tasks-for-website-related-music-lessons_~012f29b0ab31b22172/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Repair wordpress website",
        "description": "Looking for someone to repair my wordpress site. My last developer was not very good and some of the sites features keep failing. WooCommerce, Zoom and several other plugins. If I you can make the site stable, I would consider hiring you long term for day-to-day website support.",
        "tags": [
            "WordPress",
            "WordPress Plugin",
            "Web Development",
            "WooCommerce"
        ],
        "rate": "Hourly: $50.00 - $75.00",
        "exp_lvl": "Intermediate",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Repair-span-class-highlight-wordpress-span-website_~016816ee395b319115/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Go High Level - Dashboard Customization Expert",
        "description": "Hi, we are looking for a GoHighLevel expert. Someone with ample experience customizing GHL dashboards. Must have examples to be considered. We have over 100 monthly subscribers to our service. All of our clients get their own GHL dashboard. We want to customize their dashboard so each client has the same template but it's populated with their respective data. Thanks",
        "tags": [
            "SaaS Development",
            "Web Development",
            "Web Design"
        ],
        "rate": "Hourly: $15.00 - $90.00",
        "exp_lvl": "Expert",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/High-Level-Dashboard-Customization-Expert_~0116d5643bf91e1c1c/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Landing Page needed for martial arts school",
        "description": "Have a jiu jitsu school and need a better landing page. I have facebook and google ads directing to the page with the CTA signing up for a free intro class. This is an established franchise with plenty of content and assets.",
        "tags": [
            "Landing Page"
        ],
        "rate": "Hourly: $50.00 - $150.00",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Landing-Page-needed-for-martial-arts-school_~01c0b731e677f3f463/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Word Press Site Needs Fixing",
        "description": "Hello, I purchased a Word Press Site six months ago. I believed that as a novice, I could figure out how do the site myself and I was wrong. I do not understand it at all and need someone to go in and fix it and help me to publish the website as I planned. I currently have a small you tube channel https://www.youtube.com/@californiasouthernbelle and I would like to be able to direct people to a simple website that features recipes, a cook book, seasonings, aprons, t-shirts and other other branding items. I need someone who can take my idea and help me get this thing launched in September. I just want someone that is reasonable and who can assist me in completing this project.",
        "tags": [
            "WordPress",
            "Data Entry",
            "Google Docs",
            "Product Listings",
            "YouTube SEO",
            "+10"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Intermediate",
        "est_time": "$300.00",
        "link": "https://www.upwork.com/jobs/Word-Press-Site-Needs-Fixing_~01d3fe9976727de207/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Web Developer for Sporadic Event Website Updates",
        "description": "We are seeking an experienced web developer to assist with sporadic updates and maintenance for our event website as we approach our upcoming event. This role involves making updates to the site in the lead-up to the event and addressing any technical issues that arise. Urgent Requirement: We currently have an urgent issue with the registration functionality on our website that needs to be resolved by today, August 31. An immediate assistance with this issue is important.",
        "tags": [
            "WordPress",
            "Divi",
            "Web Design",
            "CSS",
            "HTML",
            "Web Development",
            "+2"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Web-Developer-for-Sporadic-Event-Website-Updates_~01571914fba3a3b9eb/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Seeking Expert Website Developer with Strong Graphic Design Skills for Corporate Law Firm",
        "description": "I am launching a NY-based corporate and securities law firm and need a website that reflects the high caliber of my practice. As a former partner at one of the largest firms in the world, my credentials speak for themselves, so the site should be sophisticated, polished, and minimalist. Key Requirements: • Impressive Home Page: The design should be on par with top private equity sites—clean, professional, and visually compelling. • Graphic Design Expertise: I prioritize strong graphic design skills over simple website development. The design must be modern, sleek, and aligned with the level of service my firm offers. • Simple Content Integration: The content is already prepared and is straightforward. The focus should be on how it's presented, not on creating complex content. • \"Less is More\" Philosophy: The site should avoid clutter and let the design and my credentials stand out. • US-Based Professionals Only: I will only consider candidates based in the United States to ensure smooth communication and collaboration. If you have experience creating visually striking websites for high-end corporate clients and understand the importance of simplicity and sophistication, I’d like to hear from you. Please provide examples of previous work that demonstrate your ability to create a site that meets these criteria.",
        "tags": [
            "WordPress",
            "Website",
            "Web Design",
            "Web Development",
            "Graphic Design",
            "+2"
        ],
        "rate": "Hourly: $50.00 - $75.00",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Seeking-Expert-Website-Developer-with-Strong-Graphic-Design-Skills-for-Corporate-Law-Firm_~01b7a77f611a56f0fb/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Web developer needed for editing of website form",
        "description": "Hi - I need to update this page - https://buckscountyphotoprinting.com/ordering with additions - text and drop down entries - as shown in the jpg attachment field adjustment - form gets sent to me as a submission - accurate update on submission - see the plug in list (screenshot of the plug ins I've used) - needs experience with HTML, javascript, contact form and maybe others - can you do it in short turnaround thank you Bill Nyman",
        "tags": [
            "WordPress",
            "Web Development",
            "Web Design",
            "HTML",
            "CSS",
            "JavaScript",
            "+2"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Intermediate",
        "est_time": "$25.00",
        "link": "https://www.upwork.com/jobs/Web-developer-needed-for-editing-website-form_~01b4e694781c392d9e/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Cleaning up Zero Waste Kauai.org",
        "description": "1)Fix the website contact form. 2) Rework design so it displays well across all devices (mobile/laptop/desktop/tablet). 3) Simplify. Less is more. Some areas feel complex. 4) Bring out more of what we are offering our viewers on home page. It needs more hooks to get them to explore further. 5) Add more calls to action to get viewers to contact and sign up, 6) Prepare pages so that content experts can easily add their information.",
        "tags": [
            "WordPress",
            "Writing",
            "Copywriting",
            "Administrative Support"
        ],
        "rate": "Hourly: $35.00 - $60.00",
        "exp_lvl": "Intermediate",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Cleaning-Zero-Waste-Kauai-org_~0176f9a38805848af1/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Modernize and Redesign Website",
        "description": "I need my outdated website to look fresh, modern, and efficient. I also want it to be able to accept payments (via Quickbooks and other payment options). I had a Woorank assessment done on my site, and it came back with several recommendations, which I would like the new design to incorporate. I have a friend in the same business I am in. He recently had his website refreshed, and it looks awesome. My website can be patterned after his site. Lawnace.com is his site.",
        "tags": [
            "WordPress",
            "Website",
            "Website Redesign",
            "Custom Web Design",
            "+6"
        ],
        "rate": "Hourly: $50.00 - $75.00",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Modernize-and-Redesign-Website_~01c5aac345886482e8/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Zoho Expert with WordPress Know-How for As-Needed Projects",
        "description": "We're looking for a skilled Zoho and WordPress expert to join our team on an as-needed basis. In this role, you'll help our small business with troubleshooting, expanding and creating processes, and automating tasks. We're seeking someone who can assist with small projects and resolve tech issues as they come up. Ideally, you’ll have experience with both Zoho and , allowing you to handle various tasks across these platforms. If you’re passionate about problem-solving and looking to build a lasting relationship with a growing business, we’d love to hear from you!",
        "tags": [
            "WordPress",
            "Zoho CRM"
        ],
        "rate": "Hourly: $30.00 - $40.00",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Zoho-Expert-with-span-class-highlight-WordPress-span-Know-How-for-Needed-Projects_~0116bb24283ef5275e/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "EE needed to replace antiquated controls on a crane must be able to make a site visit to SF bay area",
        "description": "Applicant to identify appropriate Variable frequency drives to control two 480 V 3phase motors on an old crane. Must be able to program controls and to fabricate a simple interface to control the motors. The application requires speed control and reversing capabilities. Design only is required installation can be handled by local staff. Must be able to site visit to determine total scope of project. Location Sausalito California",
        "tags": [
            "Electrical Engineering",
            "Electronics"
        ],
        "rate": "Hourly: $40.00 - $70.00",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/needed-replace-antiquated-controls-crane-must-able-make-site-visit-bay-area_~016b230427de6fd415/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "WordPress Developer for Web Page Creation, Invoicing, and Questionnaire Integration",
        "description": "Job Description: I'm seeking an experienced WordPress developer to assist with a project on an existing WordPress website built on the Divi theme/framework. The tasks include: 1. New Web Page Creation: * Develop a new web page that matches the design and layout of the current pages on the site. * Include a link on this page for visitors to make an email inquiry. 2. Invoice Setup and Payment Integration: * Create an invoice template that can be emailed to clients for payment collection. * Enable payments via Stripe and PayPal (accounts are already set up). * Set up an automated system to send a receipt, including custom text and links, once payment is received. 3. Questionnaire Creation and Integration: * Develop an online Questionnaire form. * Ensure that users can complete the form online and submit it electronically. Requirements: * Proven experience with development. * Familiarity with Stripe and PayPal payment gateways. * Ability to automate email responses with custom content. * Experience creating and integrating online forms or questionnaires. * Must be available for phone and/or online meetings to discuss project details and progress. If you can help with this project, please reach out with your qualifications and any relevant examples of past work.",
        "tags": [
            "WordPress"
        ],
        "rate": "Hourly: $35.00 - $65.00",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/span-class-highlight-WordPress-span-Developer-for-Web-Page-Creation-Invoicing-and-Questionnaire-Integration_~01f69ccddf8cbdbebb/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Design and build website with content libraries, search, and filter capabilities",
        "description": "We are building a website for healthcare organizations to access evidence assessments of social needs interventions. The website will include the components below and please see the presentation attached. We are looking for someone who has experience building such a website, and can work together in an iterative process based on user and client feedback. - password protection - primary navigation menu with four primary pages - search functionality - filter menu - card-based search results layout - evidence assessment template / page - link to contact - print - ability to embed videos We will provide all the content. Web designer will need to meet with the product manager and program manager on a weekly basis, and share updates twice a week.",
        "tags": [
            "WordPress",
            "Mockup",
            "Website",
            "Prototyping",
            "Interaction Design",
            "+4"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Intermediate",
        "est_time": "$8,000.00",
        "link": "https://www.upwork.com/jobs/Design-and-build-website-with-content-libraries-search-and-filter-capabilities_~01726138fdd2589640/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Website designer",
        "description": "Overall Theme and Feel: Therapeutic and Invigorating: The design should evoke a sense of calm, wellness, and rejuvenation, reflecting the therapeutic nature of your towels. Using a soothing color palette of greens and whites, as you've mentioned, would create a refreshing and clean look. Minimalistic and Modern: A clean, uncluttered layout with plenty of white space will help to convey the luxury and simplicity of your product. 2. Color Scheme: Primary Colors: Green and white. Use different shades of green for accents, such as buttons, headings, and call-to-action sections, while maintaining white as the background color to keep the overall look clean and fresh. Secondary Colors: Soft gray and earthy tones. These can be used for text, borders, or subtle backgrounds to add depth without overpowering the primary color scheme. 3. Typography: Font Style: Use a clean, modern sans-serif font for body text (e.g., Lato or Open Sans) to ensure readability. For headings and titles, consider a slightly bolder or more elegant font (e.g., Montserrat or Raleway) to create a contrast. Font Size: Ensure the font size is large enough for easy reading, especially for the 50+ age group. Headings should stand out, while body text should be comfortable to read. 4. Layout: Header: Include a logo (simple and elegant, possibly using green and white), navigation menu, and a call-to-action button (e.g., \"Shop Now\" or \"Learn More\"). The header should be sticky, so it remains visible as users scroll down. Hero Section: A large, high-quality image of your Invigor towels, showing their luxurious texture and design. Overlay a tagline that captures the essence of your product, such as \"Rejuvenate Your Skin with Every Use.\" Include a prominent call-to-action button here. Product Highlights: A section dedicated to showcasing the unique features of the Invigor towels, such as the patented design, non-exfoliating benefits, and use of bamboo viscose. Use icons and short descriptions for easy understanding. About Section: Share your story, highlighting the journey from your family's bookstore to developing a new path in skincare. Include a personal touch by mentioning your interest in NK Killer cells and skincare. Use images and a brief narrative to engage visitors. Product Display: A clean, grid-style display of your towels, each with a high-quality image, brief description, and price. Include a \"Buy Now\" or \"Add to Cart\" button for each product. Use hover effects to highlight products when users move their cursor over them. Testimonials: Showcase customer reviews or testimonials to build trust and credibility. Use quotes and images if available to make this section more relatable. Blog Section: Include a section for blog posts where you can share insights about skincare, the benefits of your products, and tips for maintaining healthy skin. This can also help with SEO and engaging your audience. Footer: Include contact information, social media links, a newsletter signup form, and quick links to important pages like About, Shop, Blog, and Contact Us. Use a dark background with white text to differentiate the footer from the rest of the page. 5. User Experience: Responsive Design: Ensure the website is mobile-friendly and looks great on all devices, as many users will access it from smartphones or tablets. Fast Loading: Optimize images and use efficient coding practices to ensure the site loads quickly, enhancing user experience and SEO. Easy Navigation: The site should be easy to navigate, with a clear menu structure and well-organized content. Use breadcrumbs and a search function to help users find what they're looking for. 6. Additional Features: E-commerce Functionality: Integrate a secure shopping cart and checkout system, with multiple payment options available. Consider using WooCommerce for to manage products, orders, and customer data efficiently. SEO Optimization: Use SEO best practices, such as optimizing meta tags, alt text for images, and content keywords, to help your site rank better in search engines. Analytics Integration: Set up Google Analytics to track user behavior, sales, and other key metrics to make informed decisions about marketing and website improvements. This design approach will help create a professional, user-friendly website that effectively showcases the Invigor towels and engages visitors, encouraging them to explore your products and make a purchase.",
        "tags": [
            "WordPress",
            "Web Design",
            "Web Development"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Website-designer_~01b39f9eba6e66ec66/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Build a web based sales proposal using wordpress",
        "description": "We need a creative web developer to design an intuitive, user-friendly landing page for presenting and customizing proposals for our security services company. The page should feature template management, client-specific customization, and real-time collaboration, with a modern and professional design. Experience in creating responsive, seamless interfaces is essential. Please share examples of similar work and your approach to delivering a polished final product.",
        "tags": [
            "WordPress",
            "Style Guide",
            "User Flow",
            "Adobe Illustrator",
            "Adobe Photoshop",
            "+2"
        ],
        "rate": "Hourly: $35.00 - $60.00",
        "exp_lvl": "Intermediate",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Build-web-based-sales-proposal-using-span-class-highlight-wordpress-span_~015cc3aedd5dd832c5/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Build Wordpress site to match the demo",
        "description": "I purchased a wordpress template and need help setting it up to look like the demo. It is a Gutenberg site and I have instructions from the template creator. I would also like to change the color scheme.",
        "tags": [
            "Clickbank WordPress Plugin",
            "WordPress"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Intermediate",
        "est_time": "$30.00",
        "link": "https://www.upwork.com/jobs/Build-span-class-highlight-Wordpress-span-site-match-the-demo_~01c53d7f7e7148f3c2/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Add ability to show popups to Hubspot child theme",
        "description": "I am using the Atlas theme on my Hubspot website, and it seems that it doesn't allow CTAs to appear. I need the child theme to be customized in order to work with the CTA module of Hubspot.",
        "tags": [
            "HubSpot",
            "JavaScript",
            "HTML",
            "Web Development",
            "CSS",
            "jQuery"
        ],
        "rate": "Hourly: $30.00 - $40.00",
        "exp_lvl": "Expert",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Add-ability-show-popups-Hubspot-child-theme_~01dd19cd74010bdf07/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Transfer my websites out of wix",
        "description": "Help transfer my two websites out of wix. Frustrated with wix domain management restrictions and I'd like to move my sites out of wix. Ideally into another simple visual editor (NOT wordpress please). Maybe cloudflare? Suggestions welcome. This is a somewhat urgent need, ideally I'd like to get this wrapped up today.",
        "tags": [
            "Wix",
            "Cloudflare",
            "Website",
            "Web Design"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Intermediate",
        "est_time": "$100.00",
        "link": "https://www.upwork.com/jobs/Transfer-websites-out-wix_~01f8acfa5abff17b94/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "508 Compliant HTML Editing",
        "description": "We are seeking an experienced professional to edit HTML files from SCORM packages and ensure they are 508 compliant. The ideal candidate should have a strong understanding of HTML coding and accessibility guidelines. Responsibilities include analyzing existing files, identifying areas that need modifications, and implementing changes to meet 508 compliance standards. This role requires attention to detail, problem-solving skills, and the ability to work independently. If you have previous experience in editing HTML files for 508 compliance, we would like to hear from you. Join our team and help us create accessible e-learning content.",
        "tags": [
            "WordPress",
            "HTML",
            "CSS",
            "HTML5",
            "JavaScript"
        ],
        "rate": "Hourly: $30.00 - $45.00",
        "exp_lvl": "Intermediate",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/508-Compliant-HTML-Editing_~0116717f0c48b4377d/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Wordpress expert",
        "description": "We have an existing wordpress website that we want to make more of a sales funnel. We would like to add a few or our testimonials further up on the Landing page. We prefer to do this work on our website live, meaning we go on a zoom call and move things around while we're on the call. We rather do that than send it to you, get it back, send it back etc. again, we are happy with the site just need to move sales pitches forward. Thanks",
        "tags": [
            "WordPress",
            "PHP",
            "Web Design"
        ],
        "rate": "Hourly: $25.00 - $50.00",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/span-class-highlight-Wordpress-span-expert_~019ce5c2d61c41986f/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Need Help Improving Our Website Design to Reduce Bounce Rates",
        "description": "Our website, Sereneclean.club, was fully coded and designed in-house, but we’re noticing that visitors are leaving without making a purchase. We believe our website design might be a factor contributing to this. While we’ve put in our best effort to create a functional and appealing site, we could use professional assistance to enhance the design and user experience to reduce bounce rates and increase conversions.",
        "tags": [
            "Web Design",
            "Landing Page",
            "Web Development",
            "Search Engine Optimization"
        ],
        "rate": "Hourly: $50.00 - $75.00",
        "exp_lvl": "Expert",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Need-Help-Improving-Our-Website-Design-Reduce-Bounce-Rates_~01a359708aea6cbffc/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Wildlife Conservation NGO Website Design",
        "description": "Greetings Upwork Applicants, We are an international 501c3 non-profit known as S.P.E.C.I.E.S. we engage in the preservation of our planet's wild carnivores, and the communities of people that live alongside them in 18 countries and growing via community projects, and scientific research. Our current website (carnivores.org) is quite out of date, and we are looking for a web designer that can bring S.P.E.C.I.E.S. into the modern era of web design, and help us increase our brand visibility with a completely new website that can take our users on a visual albeit informative journey following our teams work in and out of the field, and the stories of these species themselves; as well as market our upcoming wildlife tourism programme to potential clients in a way that is bespoke, and the S.P.E.C.I.E.S. brand stands out from other sites in our community. Here are some sample websites of similar organisations that we feel match the visual direction we would like to go with this project: https://www.sealegacy.org https://www.safaridrive.com https://www.thornybush.com https://ewt.org.za https://www.nationalgeographic.com/expeditions/ https://www.africanparks.org https://www.londolozi.com Thank you very much for your time, and helping us bring our work into the spotlight. Cheers and thanks, The S.P.E.C.I.E.S. team",
        "tags": [
            "User Flow",
            "Website Redesign",
            "Journey Mapping",
            "User Experience Strategy",
            "+4"
        ],
        "rate": "Hourly",
        "exp_lvl": "Intermediate",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Wildlife-Conservation-NGO-Website-Design_~01f794630f57517f02/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Define a Google Favicon to Show in Search Results",
        "description": "Looking for an experienced SEO and Digital Content Specialist freelancer with WordPress knowledge. This is a very small project, but could lead to more project opportunities. Required Experience: - Intermediate SEO knowledge - Experience in Google search - Intermediate knowledge - Graphic Design knowledge is a plus, but not required",
        "tags": [
            "WordPress",
            "Technical SEO",
            "Google",
            "Search Engine Optimization",
            "Favicon"
        ],
        "rate": "Hourly: $20.00 - $35.00",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Define-Google-Favicon-Show-Search-Results_~01b78eac33814ae287/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Web Developer for US Government Medical Assessments Site",
        "description": "We are looking for a skilled web developer to build a website that will serve as a platform for contracting with the US government for medical assessments. The website should have a professional and user-friendly design, with a focus on security and data privacy. The developer will be responsible for implementing features such as user registration, authentication, and secure data transfer. They should also ensure that the website is responsive and optimized for different devices. The ideal candidate will have experience in web development, knowledge of government contracting processes, and a strong understanding of security best practices. Relevant skills: - Web development - User registration and authentication - Data security - Responsive design - Government contracting Size: Small Duration: 1 to 3 months Expertise: Intermediate",
        "tags": [
            "WordPress",
            "Web Design",
            "Content Writing",
            "Web Development"
        ],
        "rate": "Hourly: $15.00 - $50.00",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Web-Developer-for-Government-Medical-Assessments-Site_~01c1739045ffc3813c/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Small Startup Seeks Co-Founder",
        "description": "Solo Entrepreneur Seeks Ownership Partner Do you love cats? Are you a fan of recycling and environmental consciousness? Do you want to own a small business? Progressive, queer, business owner is seeking a compatible co-owner of a unique and up-and-runnng small business that manufactures and sells a brilliant, modular floor-to-ceiling cat climber using recycled materials and requiring no floor space or drilling. The inventor and owner invested financially in the business and expects a co-owner to do the same using their own cash and/or sweat equity. Skills must include experience and expertise in social media and other marketing strategies, website maintenance, IT support, and other business and promotional possibilities. If you are dedicated, mature, energetic, enthusiastic, and would like to be the other half of an ownership pair, please get in touch.",
        "tags": [
            "WordPress",
            "Social Media Management",
            "Influencer Marketing",
            "+6"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "More than 6 months, 30+ hrs/week",
        "link": "https://www.upwork.com/jobs/Small-Startup-Seeks-Founder_~01a9ecc174c4893dcb/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Swoogo theme",
        "description": "Duplicate website in Swoogo format. https://encoremeded.swoogo.com/bestofsabcs",
        "tags": [
            "Web Design",
            "CSS",
            "HTML"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Expert",
        "est_time": "$250.00",
        "link": "https://www.upwork.com/jobs/Swoogo-theme_~01348e8f669271cc63/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Service Titan Memberships Clean Up",
        "description": "We are looking for someone to help clean up our membership data for some recurring services in Service Titan. We recently migrated from HouseCall pro to Service Titan and have one large spreadsheet of our maintenance visits (from HouseCallPro). This project would consist of cross referencing our spreadsheet and updating various statuses of memberships in our Service Titan platform. Our spreadsheet consists of all the statuses our customer plans are in from our old system and they need to be reflected properly in our new system. We need someone who has extreme attention to detail and Service Titan experience. Most of the work consists of updating membership recurring visits, changing plan statuses, and date accuracy.",
        "tags": [
            "Microsoft Excel",
            "Data Entry"
        ],
        "rate": "Hourly: $15.00 - $20.00",
        "exp_lvl": "Intermediate",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Service-Titan-Memberships-Clean_~01bbf5711100ca0eb0/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Someone to implement the rebranding of our company",
        "description": "We are an eight-year-old bookkeeping/payroll/tax prep firm. Our current business name is too long, people sometimes think it includes my last name, and it is too location specific (Montgomery, TX). We have already picked out a new name, bought the URL, and had a logo created. We just need someone who has completed a rebranding before that knows how to execute all of the customer-facing and backend technical changes that need to happen to where it looks simultaneous-like.",
        "tags": [
            "Social Media Marketing",
            "Business with 1-9 Employees",
            "Rebranding",
            "Marketing",
            "+4"
        ],
        "rate": "Hourly: $60.00 - $100.00",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Hours to be determined",
        "link": "https://www.upwork.com/jobs/Someone-implement-the-rebranding-our-company_~017541af3085f69668/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Senior WordPress/Elementor designer with PHP custom coding experience",
        "description": "We are redesigning our website to enhance its user experience and better reflect our commitment to protecting our clients. Our new site, scheduled for completion in September 2024, will be built on using Elementor and optimized for all devices. It will feature various content types and utilize WP Engine hosting. We seek an experienced Elementor developer to build the site using our provided design assets. This project does not include design, text content development, or animation. If you have strong Elementor expertise and can bring our design to life, we’d love to discuss your involvement.",
        "tags": [
            "WordPress",
            "Website Redesign",
            "Adobe Photoshop",
            "PHP",
            "JavaScript",
            "+5"
        ],
        "rate": "Hourly: $70.00 - $85.00",
        "exp_lvl": "Expert",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Senior-span-class-highlight-WordPress-span-Elementor-designer-with-PHP-custom-coding-experience_~014c0942dc37f1d72e/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Hourly website updates and maintenance",
        "description": "Our organization has several websites that we need to update regularly, and need assistance with basic content updates, creating landing pages, making minor design/ CSS changes, etc. We also occasionally need more advanced technical knowledge to troubleshoot the random plugin/php/ version compatibility issue. To show you're not a spambot, use 'OAC styleguide' in your response. If you have experience with these types of issues, please apply. This work is on an as-needed basis, so total hours would vary from month to month.",
        "tags": [
            "WordPress",
            "Landing Page",
            "PHP",
            "Web Development",
            "CSS",
            "HTML",
            "+2"
        ],
        "rate": "Hourly: $25.00 - $40.00",
        "exp_lvl": "Intermediate",
        "est_time": "3 to 6 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Hourly-website-updates-and-maintenance_~018995bd79f69e5e46/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Improve PageSpeed LCP for homepage image",
        "description": "Need to improve PageSpeed LCP for a homepage image on MOBILE. See attached. Site is in Oxygen Builder on WordPress.",
        "tags": [
            "WordPress",
            "Page Speed Optimization"
        ],
        "rate": "Hourly: $65.00 - $80.00",
        "exp_lvl": "Expert",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Improve-PageSpeed-LCP-for-homepage-image_~01d88f07885dfec333/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "NEW WordPress Landing Page Needed with Elegant, Upscale Cosmetics & Animation",
        "description": "In this video below, I have two rough demos for my new landing page, that were created by a previous developer. I am looking for someone to create a NEW landing page, starting from scratch, that follows my instruction in this video below. Unfortunately, neither of these two demos that you see in the video is ideal for a finished product, so I am seeking a new designer to start FROM SCRATCH using these ideas and instructions. I outline what I need in this video, citing the good and bad. I'll also have more content to provide for you: https://somup.com/cZjtrYmexv I’ll give you this photo of myself. I also have the logos for my colleges to go with the animation, but please note these two important things: (1) You'll probably need to modify these logos that I give you, like the previous designer did, because they are all different sizes and shapes. Please factor this into your estimate and our discussions. (2) I need to ENSURE that the animation can be seen upon page load on all devices. This previous designed didn't know how to make the animation and homepage viewable on all devices, so the problem I had is that the end user would not actually see the animation take place without scrolling down. The animation/logos simply MUST be present upon load withOUT scrolling down to see it. It has to be eye-level. It all takes place over about 2+ seconds, so obviously, no one has time to scroll down to see it anyway. Your reply should ONLY contain the following: 1. Begin your message with \"I READ IT ALL\" so I know you did so. 2. Replicate this animation (use whatever logos you have, I just need to see that you can do this properly) on multiple screens, different sizes, etc, so I know that this time, I won;t get stuck with a designer who wastes my time. If the animation won;t be at eye level on all major devices, then we're wasting time as I will not complete the order/contract.",
        "tags": [
            "WordPress",
            "Web Design",
            "Graphic Design",
            "Landing Page",
            "Web Development"
        ],
        "rate": "Hourly: $50.00 - $75.00",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/NEW-span-class-highlight-WordPress-span-Landing-Page-Needed-with-Elegant-Upscale-Cosmetics-amp-Animation_~01c7f7671675eafbdc/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Front end web designer to design simple small business website",
        "description": "Website designer to design and layout a beautiful website in Figma or another wireframe builder. I am starting a small psychotherapy practice and I need a simple, elegant, beautiful website to act as a calling card. I'm looking for someone with graphic design skills to design the site including color palette, fonts, icons, buttons, images, etc. The site will include a home page and a few content pages. That's it. I do not need you to build the site. The most important thing I need is someone with impeccable taste and design skills.",
        "tags": [
            "Figma",
            "Mockup",
            "Style Guide",
            "Custom Web Design",
            "Web Design",
            "+2"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Intermediate",
        "est_time": "$500.00",
        "link": "https://www.upwork.com/jobs/Front-end-web-designer-design-simple-small-business-website_~0116f25f6816940485/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Full-stack Developer (front&back) - No WordPress/Wix/Webflow. Need-Django/Python/HTML, CSS, JS",
        "description": "Full-stack Developer needed. Project/website creation - using WordPress/Wix/Webflow is not an option on this project. Ideally - Django, Python, HTML, CSS, JavaScript I'm looking for someone who loves to code and create from scratch. I'm an author/illustrator. Once the website is live, I'll pay-per-project/full-time, at that point. Website info - my Books ( 5 children's picture books ), with a 6th in the works. I also have one adult Christmas book still being 'worked'.",
        "tags": [
            "Full-Stack Development",
            "Django",
            "CSS",
            "JavaScript",
            "HTML"
        ],
        "rate": "Hourly: $10.00 - $37.00",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Full-stack-Developer-front-amp-back-span-class-highlight-WordPress-span-Wix-Webflow-Need-Django-Python-HTML-CSS_~0101855cd645bae021/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Elementor based webpage build off existing template with copy already set",
        "description": "We already have a previously built page that needs to have the copy/images changed with copy/images we already have. Pretty straightforward but needs to be quick and timely. Will lead to more projects.",
        "tags": [
            "WordPress",
            "Elementor"
        ],
        "rate": "Hourly: $35.00 - $60.00",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Elementor-based-webpage-build-off-existing-template-with-copy-already-set_~010a1537b1240b9c28/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Freelance Back-End Developer remote role",
        "description": "We are looking for a freelance back-end developer to join our team and assist in improving user utility, search tools, and advancing filtering. This role will involve collaborating with the front-end development team to enhance the overall user experience. The ideal candidate should have a strong understanding of back-end development principles and best practices, as well as experience with relevant technologies. Responsibilities: - Enhance user utility by implementing new features and functionality - Improve search tools and optimize filtering options - Collaborate with the front-end development team to ensure seamless integration - Debug and resolve any back-end issues that arise Skills: - Proficiency in back-end development languages such as PHP, Python, or Java - Experience with relational databases like MySQL or PostgreSQL - Knowledge of web development frameworks (e.g., Laravel, Django) - Familiarity with version control systems (e.g., Git) - Understanding of RESTful web services and API development This is a small-sized project with an estimated duration of 1 to 3 months. We are looking for an entry-level developer who can hit the ground running and contribute to the project from day one. If you have a passion for creating efficient and robust back-end solutions, we would love to hear from you!",
        "tags": [
            "WordPress",
            "PHP",
            "Web Development",
            "API",
            "JavaScript"
        ],
        "rate": "Hourly: $16.00 - $35.00",
        "exp_lvl": "Entry Level",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Freelance-Back-End-Developer-remote-role_~0169709e5b7bd08383/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Wordpress",
        "description": "We’re looking for a skilled freelancer to help drive growth for SecureDesktop.co, a cutting-edge virtual desktop solution. This role involves implementing SEO strategies, developing effective sales funnels, and managing full-scale sales and marketing initiatives. Requirements: • Proven experience in SEO and sales funnel development • Strong background in digital marketing and sales strategies • Ability to work independently and deliver results • Familiarity with the tech industry is a plus",
        "tags": [
            "WordPress",
            "Elementor",
            "Stripe"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/span-class-highlight-Wordpress-span_~013bd923ccab7d0e78/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Build responsive website for trucking company.",
        "description": "I need a website developed for my trucking company. I am okay with a basic Wordpress template being used for design. I also need all content provided and added, including images(royalty free are perfectly fine.) I need the site to include basic SEO, and I do not mean simply installing an SEO plugin and calling it a day. I want metadata and properly formatted content.",
        "tags": [
            "Website Redesign",
            "Website Optimization",
            "Web Design",
            "Web Development",
            "+5"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Intermediate",
        "est_time": "$500.00",
        "link": "https://www.upwork.com/jobs/Build-responsive-website-for-trucking-company_~01e72c66431c9a8113/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Website Design",
        "description": "Looking to hire a web designer to create a landing page for a specific event/video. Landing page will include preview to the video and user will have to fill out required information to watch full video. Design most work for Desktop and Mobile. Website edit capabilities after project is done. Example landing page here: https://punchup.live/geoffreyasmus Looking to have project completed mid-late September Very flexible with ways to communicate and talent expected to have expectation meeting before starting project. Thank you!",
        "tags": [
            "WordPress",
            "Web & Mobile Design Consultation",
            "Web Design",
            "+3"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Website-Design_~017335d995004a61b3/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Experienced WordPress (WooCommerce) Developer",
        "description": "We are seeking a skilled WordPress (WooCommerce) developer to join our team. This role involves working on a WooCommerce site hosted on WPEngine, with specific requirements for theme functionality and plugin work. Key Responsibilities: - Develop and customize WooCommerce themes to support complex product catalogs for both mobile and desktop. - Perform plugin development and updates to ensure theme functionality. - Manage site maintenance, backups, and plugin updates. - Maintain a minimal and efficient plugin set that meets the site's feature requirements. Requirements: - Proven experience in and WooCommerce development. - Familiarity with WPEngine hosting (not using WPEngine's commercial features directly). - Able to set up post purchase upsells & fraud filters. - Strong knowledge of HTML, CSS, JavaScript, and PHP. - Experience with plugin development and customization. - Ability to update and maintain themes for new features and improvements. - Strong attention to detail and ability to keep the plugin set minimal and efficient. - Able to work 9am-6pm PST M-F Preferred Skills: - Experience with mobile-first responsive design. - Familiarity with website performance optimization. - Ability to troubleshoot and resolve site issues promptly. - Excellent communication and teamwork skills. Application Process: Please provide examples of previous WooCommerce sites you have worked on, detailing your specific contributions. Include your resume and a brief cover letter explaining why you are a good fit for this role.",
        "tags": [
            "WordPress",
            "WordPress Plugin",
            "WooCommerce",
            "Ecommerce Website"
        ],
        "rate": "Hourly: $25.00 - $80.00",
        "exp_lvl": "Intermediate",
        "est_time": "3 to 6 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Experienced-span-class-highlight-WordPress-span-WooCommerce-Developer_~01f1cde4d09220648c/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Social media marketing and content creators",
        "description": "Looking for someone that have used typeset software to create e-books and content creation for social media marketing. And has done YouTube rells before.",
        "tags": [
            "WordPress",
            "Facebook Ads Manager",
            "ChatGPT",
            "Social Media Marketing",
            "+6"
        ],
        "rate": "Fixed price",
        "exp_lvl": "Expert",
        "est_time": "$500.00",
        "link": "https://www.upwork.com/jobs/Social-media-marketing-and-content-creators_~01d569035de72a9477/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Website builder for streaming video site and e-commerce",
        "description": "Building a website for a lofi channel with streaming video, merchandise, nfts, and community engagement. Need to use WordPress. Having experience in nefts, payments, music site integrations, security, and skills to create design, code, and build to full launch.",
        "tags": [
            "WordPress",
            "Web Application",
            "Adobe Photoshop",
            "Web Development",
            "+5"
        ],
        "rate": "Hourly: $20.00 - $50.00",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Website-builder-for-streaming-video-site-and-commerce_~017fe5babacbe32851/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "WordPress / Tech WRITER",
        "description": "Howdy! 🤠 We’re hiring WRITERS to contribute to the leading voices in WordPress, WooCommerce, marketing automation, email marketing, and beyond. Do you have a passion for #OpenSource and real-world **experience with development, marketing, or design?** Message us or comment below and we’ll reach out! Prior writing experience and the ability to learn and adapt to our editorial style is a must. Please submit three writing samples (articles, published) and start this proposal with \"Blue\" so we know you read the description. We can’t wait to meet you!",
        "tags": [
            "WordPress",
            "WordPress Development",
            "Blog Writing",
            "Business Writing",
            "+6"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "More than 6 months, 30+ hrs/week",
        "link": "https://www.upwork.com/jobs/span-class-highlight-WordPress-span-Tech-WRITER_~013018201c71554a49/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "E-commerce product upload",
        "description": "Good evening , I am a fashion designer and I have a website. The only thing is nobody on the team knows how to upload the clothing designs for marketing. So what we are looking for is someone who can jump on board as needed.",
        "tags": [
            "WordPress",
            "Shopify",
            "Product Listings",
            "Product Management"
        ],
        "rate": "Hourly",
        "exp_lvl": "Entry Level",
        "est_time": "3 to 6 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/commerce-product-upload_~01da994dda2b9c891a/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "WordPress Website Fixes",
        "description": "Looking for a WordPress pro to help me out with a few problems on my website. The main things I need help with are updating the website header and fixing a form submission error. It would be great if you have experience with and know how to customize website headers and fix form issues. The website is already built, so we just need to make a few adjustments to make sure everything works smoothly. You should be detail-oriented and able to work on your own. If you're dependable, great at problem-solving, and can deliver top-notch results, please apply.",
        "tags": [
            "WordPress",
            "Web Development",
            "CSS",
            "PHP",
            "Web Design"
        ],
        "rate": "Hourly",
        "exp_lvl": "Intermediate",
        "est_time": "Less than 1 month, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/span-class-highlight-WordPress-span-Website-Fixes_~016ef02c05aad4284f/?referrer_url_path=/nx/search/jobs/"
    },
    {
        "title": "Expert Developer Needed: WP Engine Atlas, Faust.js, ChakraUI, and GraphQL",
        "description": "I am seeking an experienced developer with expertise in the following specific tech stack: WP Engine Atlas Faust.js ChakraUI WordPress plugins GraphQL Key Requirements: Proven experience with WP Engine Atlas and headless development Strong proficiency in Faust.js for building front-end applications Expertise in ChakraUI for creating responsive and accessible user interfaces In-depth knowledge of GraphQL for efficient data querying Familiarity with plugins and their integration in a headless setup Additional Skills: Excellent problem-solving abilities Strong communication skills Self-motivated and able to work independently Ability to tackle complex issues without constant guidance Responsibilities: Troubleshoot and resolve issues within our existing codebase Implement new features and optimizations Ensure seamless integration between the headless backend and Faust.js frontend Understand GraphQL queries for improved performance Collaborate with team members to maintain and enhance the project The ideal candidate will have a track record of successfully working with this specific tech stack and be able to demonstrate their expertise through previous projects or code samples. I seek someone who can hit the ground running and contribute effectively to our project without requiring extensive training or hand-holding. If you have the required skills and experience, please apply with your portfolio and any relevant examples of your work with WP Engine Atlas, Faust.js, and headless development.",
        "tags": [
            "WordPress",
            "React",
            "Node.js",
            "JavaScript",
            "CSS",
            "Web Development",
            "API"
        ],
        "rate": "Hourly",
        "exp_lvl": "Expert",
        "est_time": "1 to 3 months, Less than 30 hrs/week",
        "link": "https://www.upwork.com/jobs/Expert-Developer-Needed-Engine-Atlas-Faust-ChakraUI-and-GraphQL_~010b55a3953f0022bb/?referrer_url_path=/nx/search/jobs/"
    }
]